Test/src/main/java/com/lobinary/工具类/file/xml/P00010053_request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:accountQuery.wsdl" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:ns2="soapenv">
	<SOAP-ENV:Header>
		<ns2:headerInput>
			<customerId>PB100001841</customerId>
			<customerUserId></customerUserId>
			<currentBusinessCode>00100202</currentBusinessCode>
			<channelId>2501</channelId>
			<tellerId>999999</tellerId>
			<authTellerId></authTellerId>
			<flowNo>2014122310075920023</flowNo>
			<reqTime>1419300479</reqTime>
			<wangyinflag>0</wangyinflag>
			<tokenType></tokenType>
			<challengeCode></challengeCode>
			<firstPasswd></firstPasswd>
		</ns2:headerInput>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<ns1:queryAllAccounts>
			<queryAllAccountsInput>
				<accountType />
				<currentBusinessCode>00100202</currentBusinessCode>
				<accountNo />
				<currencyType />
				<channel />
			</queryAllAccountsInput>
		</ns1:queryAllAccounts>
		<queryAllAccountsInput>
			<accountType />
			<currentBusinessCode />
			<accountNo />
			<currencyType />
			<channel />
		</queryAllAccountsInput>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>